Autodesk.Revit.DB.Structure.IRebarUpdateServer.GetCustomHandles(Autodesk.Revit.DB.Structure.RebarHandlesData)
This function should define all handles that the Rebar has.
Remarks:
Revit consider the execution failed if we have duplicate tags for custom, start and end handles.
Document should not be modified during the execution of this function.
handlesInfoData:
Use the methods on this class to define the handles for the free form rebar. Revit will use these handles to create appropriate RebarConstraints.
Returns:
Returns true if the handles were defined successfully, false otherwise.
Since:
2018